baskets = {
    143: "01",
    287: "02",
    431: "03",
    719: "04",
    1007: "05",
    1061: "06",
    1115: "07",
    1169: "08",
    1313: "09",
    1601: "10",
    1655: "11",
    1919: "12",
    2045: "13",
    2189: "14",
    2405: "15",
    2621: "16",
    2837: "17",
    3053: "18",
    3269: "19",
    3485: "20",
    3701: "21",
    3917: "22",
    4133: "23",
    4349: "24",
    4565: "25",
    4877: "26",
    5189: "27",
    5501: "28",
    5813: "29",
    6125: "30",
    6437: "31",
    6749: "32",
    7061: "33",
    7373: "34",
    7685: "35",
    7997: "36",
    8309: "37",
    8741: "38",
    9173: "39",
    9605: "40",
}


def get_basket_num(vol):
    """
    WB раскидывает запросы по разным серверам
    Эта функция определяет, к какому серверу нужно обращаться за данными по конкретному товару
    vol - это артикул товара, поделенный на 100000 нацело

    Данные можно найти в https://cdn.wbbasket.ru/api/v3/upstreams (mediabasket_route_map)
    """
    num = "41"
    min_vol = 0
    for max_vol, value in baskets.items():
        if min_vol <= vol <= max_vol:
            num = value
            break
        else:
            min_vol = max_vol + 1

    return num
